_posts/2024-09-26-Selenuim 和 Capybara 系统测试总结.html
---
permalink: /:year/:title:output_ext
toc_label: Contents
toc: true
toc_sticky: true
layout: single
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-26 四 19:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="PENG Kevin" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org6065d46" class="outline-2">
<h2 id="org6065d46"><span class="section-number-2">1.</span> 使用 selenium 和 capybara 的原因</h2>
<div class="outline-text-2" id="text-1">
<p>
个人每次网站开发修改后，都需要对功能使用手动验证一遍，以防在服务器侧部署了问题
软件。为了每次释放前能进行自动化的功能验证，不得不引入网页自动化验证的外部包，
其中 selenium 用于通过不同浏览器提供的 driver，和不同浏览器进行交互，capybara
则可以通过 selenium 为功能测试编写提供方便的 DSL，可快速编写功能测试用例。
</p>
</div>
</div>

<div id="outline-container-orgcbce151" class="outline-2">
<h2 id="orgcbce151"><span class="section-number-2">2.</span> capybara 的使用</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://github.com/teamcapybara/capybara">capybara</a> 通过调用 <a href="https://github.com/SeleniumHQ/">selenium</a> 提供的不同的浏览器 driver，来驱动和控制浏览器运行。
本篇文章基于 Rails 7.2, capybara 和 selenium-webdriver gem 在 chrome 浏览器上进行了验证。
</p>
</div>

<div id="outline-container-orgae91b63" class="outline-3">
<h3 id="orgae91b63"><span class="section-number-3">2.1.</span> 环境配置</h3>
<div class="outline-text-3" id="text-2-1">
<p>
在 Ruby，Rails 7.2, capybara，selenium-webdriver 已安装好的情况下，环境配置
如下：
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #A52A2A; font-weight: bold;">class</span> <span style="color: #2F8B58; font-weight: bold;">FuncTest</span> &lt; <span style="color: #2F8B58; font-weight: bold;">ApplicationSystemTestCase</span>
  <span style="color: #2F8B58; font-weight: bold;">Selenium</span>::<span style="color: #2F8B58; font-weight: bold;">WebDriver</span>::<span style="color: #2F8B58; font-weight: bold;">Chrome</span>.path = <span style="color: #4E9A06;">"~/.cache/selenium/chrome/linux64/129.0.6668.58/chrome"</span>
  driven_by <span style="color: #F5666D;">:selenium</span>, <span style="color: #A020F0;">using</span>: <span style="color: #F5666D;">:chrome</span>, <span style="color: #F5666D;">options:</span> {} <span style="color: #A52A2A; font-weight: bold;">do</span> |cap|
    cap.add_argument(<span style="color: #4E9A06;">"--no-sandbox"</span>)
    cap.add_argument(<span style="color: #4E9A06;">"--no-proxy-server"</span>)
    cap.add_argument(<span style="color: #4E9A06;">"--user-data-dir=</span><span style="color: #0084C8; font-weight: bold;">#{Rails.root}</span><span style="color: #4E9A06;">/tmp/chrome/"</span>)
    cap.add_preference(<span style="color: #4E9A06;">"download.default_directory"</span>, <span style="color: #4E9A06;">"</span><span style="color: #0084C8; font-weight: bold;">#{Rails.root}</span><span style="color: #4E9A06;">/test/fixtures/files/"</span>)
    <span style="color: #2F8B58; font-weight: bold;">ENV</span>.delete(<span style="color: #4E9A06;">"HTTP_PROXY"</span>)
    <span style="color: #2F8B58; font-weight: bold;">ENV</span>.delete(<span style="color: #4E9A06;">"http_proxy"</span>)
    <span style="color: #2F8B58; font-weight: bold;">ENV</span>.delete(<span style="color: #4E9A06;">"HTTPS_PROXY"</span>)
    <span style="color: #2F8B58; font-weight: bold;">ENV</span>.delete(<span style="color: #4E9A06;">"https_proxy"</span>)
  <span style="color: #A52A2A; font-weight: bold;">end</span>
<span style="color: #A52A2A; font-weight: bold;">end</span>
</pre>
</div>

<p>
chrome 的浏览器参数(argument)和配置(perference)参考 <a href="https://www.selenium.dev/documentation/webdriver/browsers/chrome/">chrome options</a> 。
perference 的全部设置可参考 <code>--user-data-dir</code> 设置的目录的 <code>Default/Perferences</code>
文件。
</p>

<p>
capybara 的文档参考 <a href="https://rubydoc.info/github/teamcapybara/capybara/master#the-dsl">capybara doc</a> 。这里的一般是最新的文档，本地使用的文档可
以如下生成：
</p>

<div class="org-src-container">
<pre class="src src-bash">yard gems
yard server --gems -s webrick
</pre>
</div>

<p>
再选择 capybara 查看。
</p>
</div>
</div>

<div id="outline-container-orgcbddc5a" class="outline-3">
<h3 id="orgcbddc5a"><span class="section-number-3">2.2.</span> capybara 常用 DSL</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org8758506" class="outline-4">
<h4 id="org8758506"><span class="section-number-4">2.2.1.</span> 基础</h4>
<div class="outline-text-4" id="text-2-2-1">
<ol class="org-ol">
<li><p>
元素选择
有 <code>css</code> 和 <code>xpath</code> 两种选择语法。
</p>
<div class="org-src-container">
<pre class="src src-ruby">page.find(<span style="color: #F5666D;">:css</span>, <span style="color: #4E9A06;">'div'</span>)
page.find(<span style="color: #F5666D;">:xpath</span>, <span style="color: #4E9A06;">'.//div'</span>)
</pre>
</div></li>

<li>元素对象常用属性和方法
<ul class="org-ul">
<li>text</li>
<li>value</li>
<li>visible?</li>
<li>tag_name</li>
<li>style</li>
<li id="send_keys">给元素发送按键消息</li>
<li>disabled?</li>
<li>click</li>
<li id="[](attribute)">设置属性</li>
<li id="others">在文档中搜索 <code>Node::Element</code> 。</li>
</ul></li>

<li><p>
限定域
</p>
<div class="org-src-container">
<pre class="src src-ruby">within(<span style="color: #4E9A06;">"#field"</span>) <span style="color: #A52A2A; font-weight: bold;">do</span>
<span style="color: #A52A2A; font-weight: bold;">end</span>
</pre>
</div>
<p>
可以缩小 find 搜索范围。
</p></li>

<li><p>
等待断言
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #204A87;"># </span><span style="color: #204A87;">&#31561;&#24453;&#20803;&#32032;&#21464;&#20026;&#21487;&#35265;</span>
assert_selector(<span style="color: #4E9A06;">"#pdf_page_info"</span>, <span style="color: #F5666D;">visible:</span> <span style="color: #F5666D;">true</span>, <span style="color: #F5666D;">wait:</span> 5)

<span style="color: #204A87;"># </span><span style="color: #204A87;">&#31561;&#24453;&#24403;&#21069;&#33410;&#28857;(within)&#20869;&#25110;&#26681;&#33410;&#28857;&#20869;&#20986;&#29616; appear</span>
<span style="color: #204A87;"># </span><span style="color: #204A87;">&#20063;&#21487;</span>
assert_text(<span style="color: #4E9A06;">"appear"</span>, <span style="color: #F5666D;">wait:</span> 5)
</pre>
</div>
<p>
更多断言在文档中搜索 <code>Capybara::Node::Matchers</code> 
</p></li>

<li><p>
内容判断
</p>
<div class="org-src-container">
<pre class="src src-ruby">page.has_content?(<span style="color: #4E9A06;">"content-xxx"</span>, <span style="color: #F5666D;">wait:</span> 3)
</pre>
</div>
<p>
等待页面出现内容 <code>content-xxx</code> ，最长等待 3 秒。
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org0e4d939" class="outline-4">
<h4 id="org0e4d939"><span class="section-number-4">2.2.2.</span> 访问网页</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-ruby">visit <span style="color: #4E9A06;">"/"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5678866" class="outline-4">
<h4 id="org5678866"><span class="section-number-4">2.2.3.</span> 上传文件</h4>
<div class="outline-text-4" id="text-2-2-3">
<div class="org-src-container">
<pre class="src src-ruby">page.attach_file(<span style="color: #2F8B58; font-weight: bold;">Rails</span>.root.join(<span style="color: #4E9A06;">"test/fixtures/files/test.pdf"</span>)) <span style="color: #A52A2A; font-weight: bold;">do</span>
  page.find(<span style="color: #4E9A06;">"#open_file_browser"</span>).click
<span style="color: #A52A2A; font-weight: bold;">end</span>
</pre>
</div>
<p>
其中点击 <code>#open_file_browser</code> , 这个事件要导致弹出文件选择框。
</p>
</div>
</div>

<div id="outline-container-orge2313c1" class="outline-4">
<h4 id="orge2313c1"><span class="section-number-4">2.2.4.</span> 按键点击</h4>
<div class="outline-text-4" id="text-2-2-4">
<div class="org-src-container">
<pre class="src src-ruby">click_button(<span style="color: #4E9A06;">"&#19978;&#20256;"</span>)
</pre>
</div>
<p>
只在按键可点击时点击，不可点击会抛出异常。
这个查找时判断按键的 <code>name</code>, <code>value</code> 等内容是否匹配。
</p>
</div>
</div>

<div id="outline-container-org3e39cf8" class="outline-4">
<h4 id="org3e39cf8"><span class="section-number-4">2.2.5.</span> 元素选择</h4>
<div class="outline-text-4" id="text-2-2-5">
<div class="org-src-container">
<pre class="src src-ruby">page.find(<span style="color: #4E9A06;">"#pdf_file_upload_label"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3e2c0b3" class="outline-4">
<h4 id="org3e2c0b3"><span class="section-number-4">2.2.6.</span> 表单填写</h4>
<div class="outline-text-4" id="text-2-2-6">
<div class="org-src-container">
<pre class="src src-ruby">within(<span style="color: #4E9A06;">"#pdf_page_info"</span>) <span style="color: #A52A2A; font-weight: bold;">do</span>
  fill_in(<span style="color: #4E9A06;">'start_content_number'</span>, <span style="color: #F5666D;">with:</span> 10)
  fill_in(<span style="color: #4E9A06;">'end_content_number'</span>, <span style="color: #F5666D;">with:</span> 13)
<span style="color: #A52A2A; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb631b80" class="outline-4">
<h4 id="orgb631b80"><span class="section-number-4">2.2.7.</span> 浏览器窗口</h4>
<div class="outline-text-4" id="text-2-2-7">
<div class="org-src-container">
<pre class="src src-ruby">page.driver.browser.window_handle
page.driver.browser.window_handles
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: PENG Kevin</p>
<p class="date">Created: 2024-09-26 四 19:02</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
